DataProcessors/А_ДвижениеПоВзаимозачетПоБалансуУпр.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>А_ДвижениеПоВзаимозачетПоБалансуУпр</Name>
			<Comment>Создание документа ВзаимозачетЗадолженности при дисбалансе управленческого баланса между подразделениями. Анализирует регистр ПрочиеАктивыПассивы. ТипДебитора=Поставщик (получил актив), ТипКредитора=Клиент (отдал актив). Условие: баланс по организации сходится, но по подразделениям - нет.</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ПрочиеАктивыПассивы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ПрочиеАктивыПассивы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>РасчетСебестоимости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИсточника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИсточниковДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиУправленческогоБаланса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИсточникДвижений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьИсточникиДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаХозяйственнойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиХозяйственныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФинЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиАктивовПассивов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ТипыДоговоров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Импорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СДавальцем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПереработчиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПоклажедателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СХранителем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентомНаЗакупку</Name>
					<Comment>00004303</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИмпортКомиссия</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыРасчетовСПартнерами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ТипыРасчетовСПартнерами</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РасчетыСПоставщиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСКлиентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСКредитором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСДебитором</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыСЛизингодателем</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОперацийВзаимозачетаЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыОперацийВзаимозачетаЗадолженности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Клиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МеждуКлиентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МеждуПоставщиками</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлиентаМеждуОрганизациями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоставщикаМеждуОрганизациями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бартер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Произвольный</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыУчастниковВзаимозачета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ТипыУчастниковВзаимозачета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Клиент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОрганизацияКлиент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОрганизацияПоставщик</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ПорядокРасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ПорядокРасчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоЗаказамНакладным</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоДоговорамКонтрагентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНакладным</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СтатусыДоговоровКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Действует</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыНалогообложенияНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ТипыНалогообложенияНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПродажаНаЭкспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаНеОблагаетсяНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаОблагаетсяНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаОсвобожденаОтНДС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВариантыОформленияЗакупок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВариантыОформленияЗакупок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеРазделять</Name>
					<Comment>Переход права собственности и поступление на склад в фин. учете оформляются одним документом "Приобретение товаров и услуг"</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварыВПути</Name>
					<Comment>Переход права собственности оформляется документом "Приобретение товаров и услуг", затем оформляется поступление на склад в фин. учете документом "Поступление на склад"</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеотфактурованныеПоставки</Name>
					<Comment>Поступление на склад в фин. учете оформляется документом "Поступление на склад", затем оформляется переход права собственности документом "Приобретение товаров и услуг"</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/А_ДвижениеПоВзаимозачетПоБалансуУпр/Ext/ObjectModule.bsl
// ============================================================================
// А_ДвижениеПоВзаимозачетПоБалансуУпр — Модуль объекта
// ============================================================================
//
// НАЗНАЧЕНИЕ:
//   Создание/обновление документа "Взаимозачет задолженности" для компенсации
//   разрыва управленческого баланса между подразделениями.
//
// КОГДА ИСПОЛЬЗОВАТЬ:
//   Вызывается из формы документа-источника дисбаланса (ПеремещениеТоваров,
//   СписаниеНедостачТоваров, ПриобретениеТоваровУслуг, СписаниеБезналичныхДС
//   и других). Работает ПОСЛЕ закрытия месяца (когда в регистре
//   ПрочиеАктивыПассивы уже есть движения по документу).
//
// ПРИНЦИП РАБОТЫ:
//   Управленческий баланс построен на двойной записи по подразделениям.
//   Баланс по организации в целом сходится (Дебет = Кредит),
//   но в разрезе подразделений — нет. Взаимозачет создает встречные
//   записи между подразделениями для устранения дисбаланса.
//
// ОПРЕДЕЛЕНИЕ СТОРОН:
//   Подразделение с Контроль > 0 (больше дебета) = ДЕБИТОР (получил актив)
//   Подразделение с Контроль < 0 (больше кредита) = КРЕДИТОР (отдал актив)
//
//   ТипДебитора = Поставщик  (дебитор "задолжал" — как покупатель товара)
//   ТипКредитора = Клиент    (кредитору "задолжали" — как продавцу товара)
//
//   Принцип: кто получил (+) — тот "задолжал" (поставщик),
//            кому отдали (-) — тому "задолжали" (клиент).
//
// ПРИМЕРЫ ДИСБАЛАНСА:
//   1. ПеремещениеТоваров (КМД-2 -> Глобино-2):
//      Глобино-2: +5810 (Товары на складах)  — ДЕБИТОР
//      КМД-2:     -5810 (Товары на складах)  — КРЕДИТОР
//      Статья: "Товары на оптовых складах - Товары на оптовых складах"
//
//   2. СписаниеНедостачТоваров (Астарта.Тищенки):
//      Астарта:   +47382 (Расходы текущего периода) — ДЕБИТОР
//      ЦО:        -47382 (Товары на складах)        — КРЕДИТОР
//      Статья: "Расходы текущего периода - Товары на оптовых складах"
//
//   3. ПриобретениеТоваровУслуг (Логистика):
//      ЦО:         +58404 (Товары на складах)  — ДЕБИТОР
//      Логистика:  -58404 (Выданные авансы)     — КРЕДИТОР
//      Статья: "Товары на оптовых складах - Выданные авансы"
//
//   4. СписаниеБезналичныхДС:
//      Логистика:     +30000 (Выданные авансы)       — ДЕБИТОР
//      Администрация: -30000 (ДС безналичные)        — КРЕДИТОР
//      Статья: "Выданные авансы - Денежные средства (безналичные)"
//
// УСЛОВИЯ СОЗДАНИЯ ВЗАИМОЗАЧЕТА:
//   1. Есть движения в ПрочиеАктивыПассивы по документу
//   2. Баланс по организации сходится (сумма Контроль = 0)
//   3. Минимум 2 подразделения с дисбалансом
//
// ИДЕМПОТЕНТНОСТЬ:
//   Поиск существующего документа по А_ДокументОснованиеДляБаланса.
//   Если найден — распроводится, очищается, перезаполняется, проводится.
//   Если не найден — создается новый.
//
// АНАЛИТИКА ДИСБАЛАНСА (А_СтатьяДисбалансаПоПодразделению):
//   Для каждого взаимозачета определяется главная статья дисбаланса
//   по каждой стороне (дебитор/кредитор) и ищется/создается элемент
//   справочника А_ДисбалансПоПодразделению с ТЧ СтатьиБаланса.
//   Это позволяет анализировать — на каких статьях актива/пассива
//   рвется баланс по подразделениям.
//
// ============================================================================

Процедура СформироватьВзаимозачетНаСервере() Экспорт

	ДокОснование = ДокументОснование;

	Если НЕ ЗначениеЗаполнено(ДокОснование) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнен документ основание!");
		Возврат;
	КонецЕсли;

	// === 1. Запит дисбалансу по підрозділах ===

	// Використовуємо віртуальну таблицю Обороты (як звіт УправленческийБалансКонтроль)
	// бо рухи можуть створюватись через РасчетСебестоимостиТоваров, а не самим документом
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Об.Подразделение КАК Подразделение,
	|	Об.Организация КАК Организация,
	|	Об.СуммаПриход КАК Дебет,
	|	Об.СуммаРасход КАК Кредит,
	|	Об.СуммаПриход - Об.СуммаРасход КАК Контроль
	|ИЗ
	|	РегистрНакопления.ПрочиеАктивыПассивы.Обороты(, , Регистратор, ) КАК Об
	|ГДЕ
	|	Об.Регистратор = &Регистратор
	|	И НЕ Об.Статья В (
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ВложенияСобственныхСредств),
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ВыводСобственныхСредств))";

	Запрос.УстановитьПараметр("Регистратор", ДокОснование);

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Баланс в порядке — дисбаланс по подразделениям не обнаружен для документа: " + ДокОснование);
		Возврат;
	КонецЕсли;

	ТаблицаДисбаланса = РезультатЗапроса.Выгрузить();

	// === 1.5. Перевірка: баланс по організації має сходитись (Дб = Кр) ===
	// Взаємозалік — тільки для міжпідрозділового дисбалансу в межах однієї організації

	ИтогоКонтроль = 0;
	Для Каждого Строка Из ТаблицаДисбаланса Цикл
		ИтогоКонтроль = ИтогоКонтроль + Строка.Контроль;
	КонецЦикла;

	Если Окр(ИтогоКонтроль, 2) <> 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Баланс по организации НЕ сходится (Дебет <> Кредит, разница: "
			+ Формат(ИтогоКонтроль, "ЧДЦ=2")
			+ "). Взаимозачет между подразделениями не применим. Документ: " + ДокОснование);
		Возврат;
	КонецЕсли;

	// === 2. Підсумувати Контроль по підрозділу ===
	// Обороты повертає окремі рядки по Статтях — потрібно згрупувати по підрозділу

	СуммыПоПодразделениям = Новый Соответствие;
	Для Каждого Строка Из ТаблицаДисбаланса Цикл
		Ключ = XMLСтрока(Строка.Подразделение);
		Текущая = СуммыПоПодразделениям.Получить(Ключ);
		Если Текущая = Неопределено Тогда
			СуммыПоПодразделениям.Вставить(Ключ, Новый Структура(
				"Подразделение, Организация, Контроль",
				Строка.Подразделение, Строка.Организация, Строка.Контроль));
		Иначе
			Текущая.Контроль = Текущая.Контроль + Строка.Контроль;
		КонецЕсли;
	КонецЦикла;

	// Перевірка: мінімум 2 підрозділи
	Если СуммыПоПодразделениям.Количество() < 2 Тогда
		Для Каждого КЗ Из СуммыПоПодразделениям Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				"Только 1 подразделение с дисбалансом — взаимозачет не создается. Подразделение: "
				+ Строка(КЗ.Значение.Подразделение)
				+ ", контроль: " + Формат(КЗ.Значение.Контроль, "ЧДЦ=2"));
			Прервать;
		КонецЦикла;
		Возврат;
	КонецЕсли;

	// === 3. Визначити дебітора і кредитора (по підсумованих значеннях) ===

	ПодразделениеДебитор = Неопределено;
	ПодразделениеКредитор = Неопределено;
	ОрганизацияДок = Неопределено;
	СуммаВзаимозачета = 0;

	Для Каждого КлючЗнач Из СуммыПоПодразделениям Цикл
		Данные = КлючЗнач.Значение;
		Если Данные.Контроль > СуммаВзаимозачета Тогда
			ПодразделениеДебитор = Данные.Подразделение;
			СуммаВзаимозачета = Данные.Контроль;
			ОрганизацияДок = Данные.Организация;
		КонецЕсли;
		Если Данные.Контроль < 0 Тогда
			Если ПодразделениеКредитор = Неопределено ИЛИ Данные.Контроль < 0 Тогда
				ПодразделениеКредитор = Данные.Подразделение;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Если ПодразделениеДебитор = Неопределено ИЛИ ПодразделениеКредитор = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Не удалось определить дебитора и кредитора из дисбаланса!");
		Возврат;
	КонецЕсли;

	// === 4. Знайти Партнерів і Контрагентів по підрозділах ===

	ПартнерДебитор = НайтиПартнераПоПодразделению(ПодразделениеДебитор);
	Если НЕ ЗначениеЗаполнено(ПартнерДебитор) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Не найден Партнер для подразделения дебитора: " + ПодразделениеДебитор);
		Возврат;
	КонецЕсли;

	КонтрагентДебитор = НайтиКонтрагентаПоПартнеру(ПартнерДебитор);
	Если НЕ ЗначениеЗаполнено(КонтрагентДебитор) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Не найден Контрагент для Партнера дебитора: " + ПартнерДебитор);
		Возврат;
	КонецЕсли;

	ПартнерКредитор = НайтиПартнераПоПодразделению(ПодразделениеКредитор);
	Если НЕ ЗначениеЗаполнено(ПартнерКредитор) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Не найден Партнер для подразделения кредитора: " + ПодразделениеКредитор);
		Возврат;
	КонецЕсли;

	КонтрагентКредитор = НайтиКонтрагентаПоПартнеру(ПартнерКредитор);
	Если НЕ ЗначениеЗаполнено(КонтрагентКредитор) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Не найден Контрагент для Партнера кредитора: " + ПартнерКредитор);
		Возврат;
	КонецЕсли;

	// === 5. Знайти Договори і ОбъектыРасчетов ===

	// Дебітор: А_ПодрОказанияУслуг = Кредитор (протилежна сторона)
	ДоговорДебитора = НайтиИлиСоздатьДоговор(КонтрагентДебитор, ПодразделениеДебитор,
		Перечисления.ТипыДоговоров.СПоставщиком, ОрганизацияДок, ПодразделениеКредитор);
	// Кредитор: А_ПодрОказанияУслуг = Дебітор (протилежна сторона)
	ДоговорКредитора = НайтиИлиСоздатьДоговор(КонтрагентКредитор, ПодразделениеКредитор,
		Перечисления.ТипыДоговоров.СПокупателем, ОрганизацияДок, ПодразделениеДебитор);

	ОбъектРасчетовДебитор = НайтиОбъектРасчетов(КонтрагентДебитор,
		Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком, ДоговорДебитора);
	ОбъектРасчетовКредитор = НайтиОбъектРасчетов(КонтрагентКредитор,
		Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом, ДоговорКредитора);

	// === 5.5. Визначити статті дисбалансу і знайти/створити А_ДисбалансПоПодразделению ===

	// Стаття дебітора: стаття з максимальним Контроль > 0 по підрозділу дебітора
	ЗапросСтДеб = Новый Запрос;
	ЗапросСтДеб.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Об.Статья КАК Статья,
	|	Об.СуммаПриход - Об.СуммаРасход КАК Контроль
	|ИЗ
	|	РегистрНакопления.ПрочиеАктивыПассивы.Обороты(, , Регистратор, ) КАК Об
	|ГДЕ
	|	Об.Регистратор = &Регистратор
	|	И Об.Подразделение = &Подразделение
	|	И НЕ Об.Статья В (
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ВложенияСобственныхСредств),
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ВыводСобственныхСредств))
	|УПОРЯДОЧИТЬ ПО
	|	Об.СуммаПриход - Об.СуммаРасход УБЫВ";
	ЗапросСтДеб.УстановитьПараметр("Регистратор", ДокОснование);
	ЗапросСтДеб.УстановитьПараметр("Подразделение", ПодразделениеДебитор);

	СтатьяДебитора = Неопределено;
	РезСтДеб = ЗапросСтДеб.Выполнить();
	ВыбСтДеб = РезСтДеб.Выбрать();
	Если ВыбСтДеб.Следующий() Тогда
		СтатьяДебитора = ВыбСтДеб.Статья;
	КонецЕсли;

	// Стаття кредитора: стаття з максимальним |Контроль| < 0 по підрозділу кредитора
	ЗапросСтКред = Новый Запрос;
	ЗапросСтКред.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Об.Статья КАК Статья,
	|	Об.СуммаПриход - Об.СуммаРасход КАК Контроль
	|ИЗ
	|	РегистрНакопления.ПрочиеАктивыПассивы.Обороты(, , Регистратор, ) КАК Об
	|ГДЕ
	|	Об.Регистратор = &Регистратор
	|	И Об.Подразделение = &Подразделение
	|	И НЕ Об.Статья В (
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ВложенияСобственныхСредств),
	|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.СтатьиАктивовПассивов.ВыводСобственныхСредств))
	|УПОРЯДОЧИТЬ ПО
	|	Об.СуммаПриход - Об.СуммаРасход ВОЗР";
	ЗапросСтКред.УстановитьПараметр("Регистратор", ДокОснование);
	ЗапросСтКред.УстановитьПараметр("Подразделение", ПодразделениеКредитор);

	СтатьяКредитора = Неопределено;
	РезСтКред = ЗапросСтКред.Выполнить();
	ВыбСтКред = РезСтКред.Выбрать();
	Если ВыбСтКред.Следующий() Тогда
		СтатьяКредитора = ВыбСтКред.Статья;
	КонецЕсли;

	ЭлементДисбаланса = Неопределено;
	Если ЗначениеЗаполнено(СтатьяДебитора) И ЗначениеЗаполнено(СтатьяКредитора) Тогда
		ЭлементДисбаланса = НайтиИлиСоздатьДисбалансПоПодразделению(СтатьяДебитора, СтатьяКредитора);
	КонецЕсли;

	// === 6. Знайти існуючий або створити новий ВзаимозачетЗадолженности ===

	ДокОбъект = Неопределено;

	ЗапросСущ = Новый Запрос;
	ЗапросСущ.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Док.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ВзаимозачетЗадолженности КАК Док
	|ГДЕ
	|	Док.А_ДокументОснованиеДляБаланса = &ДокОснование
	|	И НЕ Док.ПометкаУдаления";
	ЗапросСущ.УстановитьПараметр("ДокОснование", ДокОснование);

	РезСущ = ЗапросСущ.Выполнить();
	Если НЕ РезСущ.Пустой() Тогда
		ВыбСущ = РезСущ.Выбрать();
		ВыбСущ.Следующий();
		ДокОбъект = ВыбСущ.Ссылка.ПолучитьОбъект();

		// Распровести если проведен
		Если ДокОбъект.Проведен Тогда
			ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		КонецЕсли;

		// Очистити ТЧ
		ДокОбъект.ДебиторскаяЗадолженность.Очистить();
		ДокОбъект.КредиторскаяЗадолженность.Очистить();

		Сообщить("Обновляем существующий документ: " + ВыбСущ.Ссылка);
	Иначе
		ДокОбъект = Документы.ВзаимозачетЗадолженности.СоздатьДокумент();
		Сообщить("Создаем новый документ ВзаимозачетЗадолженности");
	КонецЕсли;

	// === 7. Заповнити шапку ===

	ДокОбъект.Дата = ДокОснование.Дата;
	ДокОбъект.Организация = ОрганизацияДок;
	ДокОбъект.ВидОперации = Перечисления.ВидыОперацийВзаимозачетаЗадолженности.Произвольный;
	ДокОбъект.КонтрагентДебитор = КонтрагентДебитор;
	ДокОбъект.КонтрагентКредитор = КонтрагентКредитор;
	ДокОбъект.ТипДебитора = Перечисления.ТипыУчастниковВзаимозачета.Поставщик;
	ДокОбъект.ТипКредитора = Перечисления.ТипыУчастниковВзаимозачета.Клиент;
	ДокОбъект.СуммаРегл = СуммаВзаимозачета;
	ДокОбъект.СуммаУпр = СуммаВзаимозачета;
	ДокОбъект.А_ДокументОснованиеДляБаланса = ДокОснование;
	ДокОбъект.А_ВведенВЕРП = Истина;
	Если ЗначениеЗаполнено(ЭлементДисбаланса) Тогда
		ДокОбъект.А_СтатьяДисбалансаПоПодразделению = ЭлементДисбаланса;
	КонецЕсли;

        
	// Валюта UAH
	ВалютаUAH = Справочники.Валюты.НайтиПоКоду("980");
	Если НЕ ЗначениеЗаполнено(ВалютаUAH) Тогда
		ВалютаUAH = Справочники.Валюты.НайтиПоНаименованию("UAH");
	КонецЕсли;

	// === 8. Заповнити ДебиторскаяЗадолженность ===

	СтрокаДеб = ДокОбъект.ДебиторскаяЗадолженность.Добавить();
	СтрокаДеб.Партнер = ПартнерДебитор;
	СтрокаДеб.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком;
	СтрокаДеб.СуммаВзаиморасчетов = СуммаВзаимозачета;
	СтрокаДеб.СуммаРегл = СуммаВзаимозачета;
	СтрокаДеб.СуммаУпр = СуммаВзаимозачета;
	СтрокаДеб.ВалютаВзаиморасчетов = ВалютаUAH;
	СтрокаДеб.Организация = ОрганизацияДок;
	Если ЗначениеЗаполнено(ОбъектРасчетовДебитор) Тогда
		СтрокаДеб.ОбъектРасчетов = ОбъектРасчетовДебитор;
	КонецЕсли;

	// === 9. Заповнити КредиторскаяЗадолженность ===

	СтрокаКред = ДокОбъект.КредиторскаяЗадолженность.Добавить();
	СтрокаКред.Партнер = ПартнерКредитор;
	СтрокаКред.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом;
	СтрокаКред.СуммаВзаиморасчетов = СуммаВзаимозачета;
	СтрокаКред.СуммаРегл = СуммаВзаимозачета;
	СтрокаКред.СуммаУпр = СуммаВзаимозачета;
	СтрокаКред.ВалютаВзаиморасчетов = ВалютаUAH;
	СтрокаКред.Организация = ОрганизацияДок;
	Если ЗначениеЗаполнено(ОбъектРасчетовКредитор) Тогда
		СтрокаКред.ОбъектРасчетов = ОбъектРасчетовКредитор;
	КонецЕсли;

	// === 10. Провести ===

	Попытка
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Сообщить("Документ успешно проведен: " + ДокОбъект.Ссылка
			+ " | Сумма: " + Формат(СуммаВзаимозачета, "ЧДЦ=2")
			+ " | Дебитор: " + Строка(ПодразделениеДебитор)
			+ " | Кредитор: " + Строка(ПодразделениеКредитор));
	Исключение
		Сообщить("ОШИБКА проведения: " + ОписаниеОшибки());
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
			Сообщить("Документ записан без проведения: " + ДокОбъект.Ссылка);
		Исключение
			Сообщить("ОШИБКА записи: " + ОписаниеОшибки());
		КонецПопытки;
	КонецПопытки;

КонецПроцедуры


// ===== Допоміжні функції =====

Функция НайтиПартнераПоПодразделению(Подразделение)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	П.Ссылка КАК Партнер
	|ИЗ
	|	Справочник.Партнеры КАК П
	|ГДЕ
	|	П.А_Подразделение = &Подразделение
	|	И НЕ П.ПометкаУдаления";
	Запрос.УстановитьПараметр("Подразделение", Подразделение);

	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Запрос2 = Новый Запрос;
		Запрос2.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	П.Ссылка КАК Партнер
		|ИЗ
		|	Справочник.Партнеры КАК П
		|ГДЕ
		|	П.Наименование = &Наименование
		|	И НЕ П.ПометкаУдаления";
		Запрос2.УстановитьПараметр("Наименование", Строка(Подразделение));
		Результат = Запрос2.Выполнить();
		Если Результат.Пустой() Тогда
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;

	Выб = Результат.Выбрать();
	Выб.Следующий();
	Возврат Выб.Партнер;

КонецФункции

Функция НайтиКонтрагентаПоПартнеру(Партнер)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	К.Ссылка КАК Контрагент
	|ИЗ
	|	Справочник.Контрагенты КАК К
	|ГДЕ
	|	К.Партнер = &Партнер
	|	И НЕ К.ПометкаУдаления";
	Запрос.УстановитьПараметр("Партнер", Партнер);

	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Выб = Результат.Выбрать();
	Выб.Следующий();
	Возврат Выб.Контрагент;

КонецФункции

Функция НайтиИлиСоздатьДоговор(Контрагент, Подразделение, ТипДоговора, Организация, ПодразделениеОказанияУслуг)

	// Пошук по Контрагент + ТипДоговора + Подразделение + Организация + А_ПодрОказанияУслуг
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Д.Ссылка КАК Договор
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК Д
	|ГДЕ
	|	Д.Контрагент = &Контрагент
	|	И Д.ТипДоговора = &ТипДоговора
	|	И Д.Подразделение = &Подразделение
	|	И Д.Организация = &Организация
	|	И Д.А_ПодразделениеОказаниеУслугПодразделению = &ПодрОказания
	|	И НЕ Д.ПометкаУдаления";
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ТипДоговора", ТипДоговора);
	Запрос.УстановитьПараметр("Подразделение", Подразделение);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ПодрОказания", ПодразделениеОказанияУслуг);

	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выб = Результат.Выбрать();
		Выб.Следующий();
		Возврат Выб.Договор;
	КонецЕсли;

	Попытка
		НовыйДоговор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();

		// Назва: "МД ООН внутр.(Закупка)" або "МД ООН №49 внутр.(Реализация)"
		ТипНазва = ?(ТипДоговора = Перечисления.ТипыДоговоров.СПоставщиком, "Закупка", "Реализация");
		НовыйДоговор.Наименование = Строка(ПодразделениеОказанияУслуг) + " внутр.(" + ТипНазва + ")";
		НовыйДоговор.Контрагент = Контрагент;
		НовыйДоговор.Партнер = Контрагент.Партнер;
		НовыйДоговор.Организация = Организация;
		НовыйДоговор.Подразделение = Подразделение;
		НовыйДоговор.А_ПодразделениеОказаниеУслугПодразделению = ПодразделениеОказанияУслуг;

		НовыйДоговор.ТипДоговора = ТипДоговора;
		НовыйДоговор.ВалютаВзаиморасчетов = Справочники.Валюты.НайтиПоКоду("980");
		НовыйДоговор.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоДоговорамКонтрагентов;

		Если ТипДоговора = Перечисления.ТипыДоговоров.СПокупателем Тогда
			НовыйДоговор.ГруппаФинансовогоУчета = Справочники.ГруппыФинансовогоУчетаРасчетов.НайтиПоНаименованию(
				"Расчеты с покупателями в национальной валюте");
		Иначе
			НовыйДоговор.ГруппаФинансовогоУчета = Справочники.ГруппыФинансовогоУчетаРасчетов.НайтиПоНаименованию(
				"Расчеты с поставщиками в национальной валюте");
		КонецЕсли;

		НовыйДоговор.Статус = Перечисления.СтатусыДоговоровКонтрагентов.Действует;
		НовыйДоговор.Согласован = Истина;
		НовыйДоговор.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОсвобожденаОтНДС;
		НовыйДоговор.ВариантОформленияЗакупок = Перечисления.ВариантыОформленияЗакупок.НеРазделять;
		НовыйДоговор.МоментОпределенияБазыНДС = Перечисления.МоментыОпределенияНалоговойБазы.ПоОтгрузке;
		НовыйДоговор.СпособДоставки = Перечисления.СпособыДоставки.ОпределяетсяВРаспоряжении;

		НовыйДоговор.Записать();
		Сообщить("Создан договор: " + НовыйДоговор.Наименование + " (" + Строка(ТипДоговора) + ")");
		Возврат НовыйДоговор.Ссылка;
	Исключение
		Сообщить("Ошибка создания договора: " + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;

КонецФункции

Функция НайтиОбъектРасчетов(Контрагент, ТипРасчетов, Договор)

	Если НЕ ЗначениеЗаполнено(Договор) Тогда
		Возврат Неопределено;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОР.Ссылка КАК ОбъектРасчетов
	|ИЗ
	|	Справочник.ОбъектыРасчетов КАК ОР
	|ГДЕ
	|	ОР.Контрагент = &Контрагент
	|	И ОР.ТипРасчетов = &ТипРасчетов
	|	И ОР.Договор = &Договор
	|	И НЕ ОР.ПометкаУдаления";
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("ТипРасчетов", ТипРасчетов);
	Запрос.УстановитьПараметр("Договор", Договор);

	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выб = Результат.Выбрать();
		Выб.Следующий();
		Возврат Выб.ОбъектРасчетов;
	КонецЕсли;

	Возврат Неопределено;

КонецФункции

Функция НайтиИлиСоздатьДисбалансПоПодразделению(СтатьяДебитора, СтатьяКредитора)

	// Пошук елемента по ТЧ СтатьиБаланса (точний збіг 2 статей)
	СписокСтатей = Новый СписокЗначений;
	СписокСтатей.Добавить(СтатьяДебитора);
	СписокСтатей.Добавить(СтатьяКредитора);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТЧ.Ссылка КАК Элемент,
	|	КОЛИЧЕСТВО(ТЧ.НомерСтроки) КАК КолСтрок,
	|	СУММА(ВЫБОР
	|		КОГДА ТЧ.Статья В (&СписокСтатей)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ) КАК Совпадений
	|ИЗ
	|	Справочник.А_ДисбалансПоПодразделению.СтатьиБаланса КАК ТЧ
	|ГДЕ
	|	НЕ ТЧ.Ссылка.ПометкаУдаления
	|СГРУППИРОВАТЬ ПО
	|	ТЧ.Ссылка";
	Запрос.УстановитьПараметр("СписокСтатей", СписокСтатей);

	Результат = Запрос.Выполнить();
	Выб = Результат.Выбрать();

	Пока Выб.Следующий() Цикл
		// Точний збіг: кількість рядків = 2 і всі 2 співпали
		Если Выб.КолСтрок = 2 И Выб.Совпадений = 2 Тогда
			Возврат Выб.Элемент;
		КонецЕсли;
	КонецЦикла;

	// Не знайдено — створити новий елемент
	Попытка
		НовыйЭлемент = Справочники.А_ДисбалансПоПодразделению.СоздатьЭлемент();
		НовыйЭлемент.Наименование = Строка(СтатьяДебитора) + " - " + Строка(СтатьяКредитора);

		Стр1 = НовыйЭлемент.СтатьиБаланса.Добавить();
		Стр1.Статья = СтатьяДебитора;

		Стр2 = НовыйЭлемент.СтатьиБаланса.Добавить();
		Стр2.Статья = СтатьяКредитора;

		НовыйЭлемент.Записать();
		Сообщить("Создан элемент дисбаланса: " + НовыйЭлемент.Наименование);
		Возврат НовыйЭлемент.Ссылка;
	Исключение
		Сообщить("Ошибка создания элемента дисбаланса: " + ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки;

КонецФункции
